# Python Working with Data
* Author: Jason J Ortiz 
* Github Repository: https://github.com/BbBot64/Python_Essentials 

* Reading & Writing Files with Open
  * Reading Files with Open
  * Writing Files with Open
* Pandas
  * Loading Data with Pandas
  * Working with and Saving Data with Pandas
* Numpy
  * One-Dimensional Numpy
  * Two-Dimensional Numpy

### Reading & Writing Files with Open
* General Formatting
*

#### General Formatting
* Start with creating a File Object
  * File_1 = open("supporting_data\Example_File_1.txt", "r/w/a")
#
  * open() -> Open function
#
  * "supporting_data\Example_File_1.txt" -> File Path
    * supporting_data\ -> Directory 
    * Example_File_1.txt -> File Name
#
  * "r/w/a" -> Mode
    * r -> Read
    * w -> Write
    * a -> Append
#
  * File_1 -> File Object
    * Attributes/methods such as:
      * .name
      * .mode
      * .read()
      * .close() -> Super Important! Will solve with "with _ as _ :" statement which automatically closes the file object

##### Reading Data from a File

In [1]:
with open("supporting_data\Example_File_1.txt", "r") as File_1:

    file_contents_1 = File_1.read()

    print(f'Example_File_1 Contents:\n{file_contents_1}')

print(f'\nFile is closed: {File_1.closed}')
print(f'\nConfirmation that data is stored in variable file_contents_1 after closing file:\n{file_contents_1}')

Example_File_1 Contents:
Congratulations: You Found the Secret!

This is some Dummy text.
There's a possibility nobody ever reads this.
    If you do please feel free to sign your name below.
I'll start using Python to read and write the file!

Names:


File is closed: True

Confirmation that data is stored in variable file_contents_1 after closing file:
Congratulations: You Found the Secret!

This is some Dummy text.
There's a possibility nobody ever reads this.
    If you do please feel free to sign your name below.
I'll start using Python to read and write the file!

Names:

##### Reading Individual Lines:
* .readline() -> Everytime it's called it prints the lines one at a time

In [2]:
with open("supporting_data\Example_File_1.txt", "r") as File_1:
    file_contents_1_line_1 = File_1.readline()
    print(file_contents_1_line_1)

Congratulations: You Found the Secret!

In [3]:
with open("supporting_data\Example_File_1.txt", "r") as File_1:
    
    file_1_line_1 = File_1.readline()
    print(f'First Line of Example_File_1.txt:\n{file_1_line_1}')
    
    File_1.readline()

    file_1_line_3 = File_1.readline()
    print(f'Third Line of Example_File_1.txt:\n{file_1_line_3}')

First Line of Example_File_1.txt:
Congratulations: You Found the Secret!

Third Line of Example_File_1.txt:
This is some Dummy text.

##### Writing Data to a File
* Creates a file with the name of your choice, in the directory of your choice.
* Usually end with "\n" for new line -> equivalent to using Java println()
* Can use loops to write multiple lines to a file

In [6]:
with open("supporting_data\Example_File_2.txt", "w") as File_2:
    File_2.write("This is a second dummy text file.\n")
    File_2.write("This is just here to show off the power of Python I/O.\n")

In [7]:
with open("supporting_data/Example_File_2.txt", 'r') as File_2:
    file_2 = File_2.read()
    print(f'Example_File_2 contents\n{file_2}')

Example_File_2 contents
This is a second dummy text file.
This is just here to show off the power of Python I/O.

##### Writing with Loops

In [8]:
lines_to_write = ["This is Line A\n", "This is Line B\n", "This is Line C\n..."]

with open("supporting_data\Example_File_3.txt", "w") as File_3:
    
    for line in lines_to_write:
        File_3.write(line)

In [10]:
with open("supporting_data/Example_File_3.txt", 'r') as File_3:
    file_3 = File_3.read()
    print(f'Example_File_3 contents\n{file_3}')

Example_File_3 contents
This is Line A
This is Line B
This is Line C
...

##### Appending to a File
* Adds new data into a new line in the File

In [11]:
with open("supporting_data/Example_File_1.txt", "a") as File_1_modified:
    File_1_modified.write("Jason J Ortiz -> Creator\n")

In [16]:
with open("supporting_data/Example_File_1.txt", 'r') as File_1_modified:
    file_1_modified_content = File_1_modified.read()
    print(f'Example_File_1 contents after being modified\n{file_1_modified_content}')

Example_File_1 contents after being modified
Congratulations: You Found the Secret!

This is some Dummy text.
There's a possibility nobody ever reads this.
    If you do please feel free to sign your name below.
I'll start using Python to read and append the file!

Names:
Jason J Ortiz -> Creator

##### Copying one File to a new File

In [18]:
with open("supporting_data/Example_File_2.txt") as read_file:
    with open("supporting_data/Example_File_4.txt", "w") as write_file:
        for line in read_file:
            write_file.write(line)

In [19]:
with open("supporting_data/Example_File_4.txt", 'r') as File_4:
    file_4_content = File_4.read()
    print(f'Example_File_4 contents\n{file_4_content}')

Example_File_4 contents
This is a second dummy text file.
This is just here to show off the power of Python I/O.

### Pandas
* Loading Data with Pandas
* Working with and Saving Data

In [4]:
# Importing Pandas Library
import pandas as pd

#### Loading Data with Pandas
* Mock data generated by https://www.mockaroo.com/

In [5]:
# Saving csv_path in separate variable for readability/reusability
csv_path = 'supporting_data/mockaroo_data_coursera_IMB.csv'
dataframe = pd.read_csv(csv_path)

In [6]:
# df.head(n): Read the first n rows, default 5
dataframe.head()

,id,first_name,last_name,email,gender,age,student,employed,checking_account,saving_account
0,1,Yuri,Woollam,ywoollam0@smh.com.au,Male,33,False,False,30495.56,4244392.36
1,2,Consalve,Audsley,caudsley1@skyrock.com,Male,39,True,False,729910.09,3277128.00
2,3,Seana,Hinze,shinze2@reverbnation.com,Female,39,True,True,524771.18,2028913.50
3,4,Ivette,Sisse,isisse3@multiply.com,Female,16,True,True,186207.74,417373.23
4,5,Travers,Elmhurst,telmhurst4@gnu.org,Male,41,True,False,316689.98,1435229.19

In [12]:
# Saving column(s) in variables
email = dataframe[['email']]
email.head()

                      email
0      ywoollam0@smh.com.au
1     caudsley1@skyrock.com
2  shinze2@reverbnation.com
3      isisse3@multiply.com
4        telmhurst4@gnu.org

In [17]:
age = dataframe[['age']]
age.head(10)

   age
0   33
1   39
2   39
3   16
4   41
5   52
6   17
7   93
8   20
9   89

In [14]:
full_name = dataframe[['first_name', 'last_name']]
full_name.head()

  first_name last_name
0       Yuri   Woollam
1   Consalve   Audsley
2      Seana     Hinze
3     Ivette     Sisse
4    Travers  Elmhurst

#### Working with and Saving Data
* List Unique Values
* Filtering Data

##### List Unique Values

In [30]:
# age.unique() doesn't work as you need to pass a column, not a dataframe
age['age'].unique()

array([ 33,  39,  16,  41,  52,  17,  93,  20,  89,  27,  15,  50,  28,
        23,  61,  51,  38,  59,  42,  58, 100,  40,  65,  79,  47,  35,
        36,  55,  68,  73,  60,  71,  81,  31,  66,  84,  32,  56,  25,
        49,  97,  96,  78,  76,  18,  75,  63,  67,  19,  74,  85,  90,
        82,  95,  70,  87,  53,  45,  22,  80,  77,  26,  88,  46,  14,
        94,  29,  30,  43,  57,  62,  44,  54,  99,  72,  86,  98,  24,
        48,  13,  83,  64,  34,  69,  92,  91,  21,  37], dtype=int64)

In [33]:
# or
dataframe['age'].unique()

array([ 33,  39,  16,  41,  52,  17,  93,  20,  89,  27,  15,  50,  28,
        23,  61,  51,  38,  59,  42,  58, 100,  40,  65,  79,  47,  35,
        36,  55,  68,  73,  60,  71,  81,  31,  66,  84,  32,  56,  25,
        49,  97,  96,  78,  76,  18,  75,  63,  67,  19,  74,  85,  90,
        82,  95,  70,  87,  53,  45,  22,  80,  77,  26,  88,  46,  14,
        94,  29,  30,  43,  57,  62,  44,  54,  99,  72,  86,  98,  24,
        48,  13,  83,  64,  34,  69,  92,  91,  21,  37], dtype=int64)

In [36]:
# or you could use a set
set(dataframe['age'].values)

{13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100}

##### Filtering Data

In [49]:
over_50 = dataframe[dataframe['age'] > 50]
over_50.head()

,id,first_name,last_name,email,gender,age,student,employed,checking_account,saving_account
5,6,Roselle,Theodore,rtheodore5@elegantthemes.com,Female,52,True,False,767879.56,2931223.04
7,8,Stanley,Mogie,smogie7@cafepress.com,Male,93,False,False,720380.47,2723017.00
9,10,Appolonia,Deek,adeek9@flickr.com,Agender,89,False,True,631998.00,2494973.76
15,16,Antonie,Tweedie,atweedief@biglobe.ne.jp,Female,61,True,True,327170.58,4522711.00
17,18,Dre,Shorbrook,dshorbrookh@angelfire.com,Bigender,51,False,True,953081.30,940340.27

In [51]:
# Another way of achieving the same results
over_50 = dataframe[age.values > 50]
over_50.head()

,id,first_name,last_name,email,gender,age,student,employed,checking_account,saving_account
5,6,Roselle,Theodore,rtheodore5@elegantthemes.com,Female,52,True,False,767879.56,2931223.04
7,8,Stanley,Mogie,smogie7@cafepress.com,Male,93,False,False,720380.47,2723017.00
9,10,Appolonia,Deek,adeek9@flickr.com,Agender,89,False,True,631998.00,2494973.76
15,16,Antonie,Tweedie,atweedief@biglobe.ne.jp,Female,61,True,True,327170.58,4522711.00
17,18,Dre,Shorbrook,dshorbrookh@angelfire.com,Bigender,51,False,True,953081.30,940340.27

In [61]:
over_50.iloc[4, 3]

'dshorbrookh@angelfire.com'

In [68]:
over_50.loc[5:17, 'gender']

5       Female
7         Male
9      Agender
15      Female
17    Bigender
Name: gender, dtype: object

##### Saving Data as .CSV
* saving to the supporting_data directory
* the final piece is the name you wish to give the new file, followed by .csv (since you call the to_csv() function)

In [53]:
over_50.to_csv('supporting_data/moackaroo_bank_accounts_over_50.csv')

### Numpy
* One-Dimensional Numpy
* Two-Dimensional Numpy